[AWCCostFixW_MCMScreen]
ModName=Ability Interaction Fixes
PageTitle=Ability Interaction Fixes

GroupHeader[0]=Multishot Kill Trigger Fixes

FIX_SERIAL_TRIGGER_Label=Fix 'Serial' Trigger
FIX_SERIAL_TRIGGER_Tip='Serial' only triggers for kills with 'Rapid Fire', 'Chain Shot' and 'Banish' if they kill with the first shot. This fix enables 'Serial' to trigger for all kills with these multi-shot abilities.

FIX_DEATHFROMABOVE_TRIGGER_Label=Fix 'Death from Above' Trigger
FIX_DEATHFROMABOVE_TRIGGER_Tip='Death from Above' only triggers for kills with 'Rapid Fire', 'Chain Shot' and 'Banish' if they kill with the first shot. This fix enables 'Death from Above' to trigger for all kills with these multi-shot abilities.

GroupHeader[1]=Bonus Action Point Fixes
FIX_REAPER_MOMENTUM_Label=Fix 'Reaper' Interaction with 'Momentum'/'Parry'
FIX_REAPER_MOMENTUM_Tip=By design, 'Reaper' completely disables 'Momentum'. This was presumably to stop double/dash moves for each attack with Reaper. This Fix allows the AP granted by 'Reaper' to be used for Parry, as well as all other actions. This means the Templar can always parry after a 'Rend'.

FIX_IMPLACABLE_CONSUMPTION_Label=Fix Implacable AP being consumed by turn ending actions.
FIX_IMPLACABLE_CONSUMPTION_Tip=This avoids Implacable being "wasted" when kills are from non-turn ending actions or other abilities grant additional action points, which allow non-move actions to be used after Implacable procs.

GroupHeader[2]=Miscellaneous Fixes
FIX_COMBATPROTOCOL_ROBOTIC_Label=Fix 'Combat Protocol' bonus damage
FIX_COMBATPROTOCOL_ROBOTIC_Tip='Combat Protocol', like most single target damage abilities, can target Mind Controlled or Hacked enemy units you control. However, the extra damage to Robotic enemies is not correctly applied to such units without this fix.
FIX_ARCWAVE_Label=Restore Rend's jumping attack with ArcWave
FIX_ARCWAVE_Tip=Once a Templar gains ArcWave, the Rend animation for moving attacks loses it's fancy jumping animation, this fix restores the jumping animation.
FIX_ANNIHILATE_Label=Fix 'Annihilate' Trigger
FIX_ANNIHILATE_Tip='Annihlate' only triggers when a shot from 'Banish' actually gets the kill. This allows 'Annihilate' to continue to the next target if the death is caused for other reasons (eg 'Homing Mine' or collateral damage explosions), or even if the original target is not killed but can no longer be targeted (eg Stasis or falls out of sight due to floor damage).